Documents/ЗаполнениеСудебныхУчастковДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗаполнениеСудебныхУчастковДолжников</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПользовательУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСтатусаЗаполненияСУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СудебныйУчасток</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СудебныеУчастки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФорматАдреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидФормата</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидФорматаАдресаСУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КОтправкеДокументовСУКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КОтправкеДокументовСУКлиент</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаполнениеСудебныхУчастковДолжников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидСтатусаЗаполненияСУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидСтатусаЗаполненияСУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтправкеКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненСервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученВСервисе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученКлиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаполнениеСудебныхУчастковДолжников/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(ПользовательУслуги) Тогда
		ПользовательУслуги = Константы.СервисСУЛогин.Получить();	
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Статус = Перечисления.ВидСтатусаЗаполненияСУ.КОтправкеКлиент Тогда
		МенеджерЗаписи = РегистрыСведений.КОтправкеДокументовСУКлиент.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Документ = Ссылка;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.КОтправкеДокументовСУКлиент.СоздатьНаборЗаписей();	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		РеглЗад = РегламентныеЗадания.НайтиПредопределенное("Сервис_СудебныеУчастки");
		РеглЗад.Использование = Истина;
		РеглЗад.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	МенеджерЗаписи = РегистрыСведений.КОтправкеДокументовСУКлиент.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Документ = Ссылка;
	МенеджерЗаписи.Удалить();
КонецПроцедуры
